pinkymaxou/motorcycle-lightning/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# 1 kHz tick so vTaskDelayUntil(13ms) is precise for the ~75 FPS render loop
CONFIG_FREERTOS_HZ=1000

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# HTTP server: roomy headers for browsers, WebSocket push for the live view
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=128
CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_LWIP_MAX_SOCKETS=10

# Render task subscribes to the task WDT, and a stuck task must RESET the
# module, not just log: frozen lights are worse than dark ones, and the boot
# sequence latches the strips black before anything else runs.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y
# The panic handler itself must not live in flash. We write to flash (config,
# learned flasher period, crash log), and a crash while the flash cache is
# disabled would leave the handler unable to run: the board hangs forever
# instead of rebooting — the exact failure this watchdog exists to prevent.
CONFIG_ESP_PANIC_HANDLER_IRAM=y

# RMT ISR + led_strip encoder in IRAM: the strip keeps refreshing during
# flash writes (config saves) instead of glitching — the ESP32 RMT has no DMA
CONFIG_RMT_ISR_IRAM_SAFE=y

# OTA: the bootloader starts a freshly written app in PENDING_VERIFY and rolls
# back to the previous slot unless the app marks itself valid, which main.cpp
# only does once the boot sequence completed and the strips are lit.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
